app/Models/ModelKrs.php

    public function DataMhs()
    {
        return $this->db->table('tbl_mhs')
        ->join('tbl_prodi', 'tbl_prodi.id_prodi = tbl_mhs.id_prodi', 'left')
        ->join('tbl_fakultas', 'tbl_fakultas.id_fakultas = tbl_prodi.id_fakultas', 'left')
        ->join('tbl_kelas', 'tbl_kelas.id_kelas = tbl_mhs.id_kelas', 'left')
        ->join('tbl_dosen', 'tbl_dosen.id_dosen = tbl_kelas.id_dosen', 'left')
        ->where('nim',session()->get('username'))
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_mhs`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi` = `tbl_mhs`.`id_prodi`
LEFT JOIN `tbl_fakultas` ON `tbl_fakultas`.`id_fakultas` = `tbl_prodi`.`id_fakultas`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_mhs`.`id_kelas`
LEFT JOIN `tbl_dosen` ON `tbl_dosen`.`id_dosen` = `tbl_kelas`.`id_dosen`
WHERE `nim` = '1111111'

    public function MatkulDitawarkan($id_ta, $id_prodi)
    {
        return $this->db->table('tbl_jadwal')
        ->join('tbl_matkul', 'tbl_matkul.id_matkul = tbl_jadwal.id_matkul', 'left')
        ->join('tbl_kelas', 'tbl_kelas.id_kelas = tbl_jadwal.id_kelas', 'left')
        ->join('tbl_ruangan', 'tbl_ruangan.id_ruangan = tbl_jadwal.id_ruangan', 'left')
        ->join('tbl_dosen', 'tbl_dosen.id_dosen = tbl_jadwal.id_dosen', 'left')
        ->join('tbl_prodi', 'tbl_prodi.id_prodi = tbl_jadwal.id_prodi', 'left')
        ->where('tbl_jadwal.id_ta', $id_ta)
        ->where('tbl_jadwal.id_prodi', $id_prodi)
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_jadwal`
LEFT JOIN `tbl_matkul` ON `tbl_matkul`.`id_matkul` = `tbl_jadwal`.`id_matkul`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_jadwal`.`id_kelas`
LEFT JOIN `tbl_ruangan` ON `tbl_ruangan`.`id_ruangan` = `tbl_jadwal`.`id_ruangan`
LEFT JOIN `tbl_dosen` ON `tbl_dosen`.`id_dosen` = `tbl_jadwal`.`id_dosen`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi` = `tbl_jadwal`.`id_prodi`
WHERE `tbl_jadwal`.`id_ta` = '1'
AND `tbl_jadwal`.`id_prodi` = '1'

    public function DataKrs($id_mhs, $id_ta)
    {
        return $this->db->table('tbl_krs')
        ->join('tbl_jadwal', 'tbl_jadwal.id_jadwal = tbl_krs.id_jadwal', 'left')
        ->join('tbl_matkul', 'tbl_matkul.id_matkul = tbl_jadwal.id_matkul', 'left')
        ->join('tbl_kelas', 'tbl_kelas.id_kelas = tbl_jadwal.id_kelas', 'left')
        ->join('tbl_ruangan', 'tbl_ruangan.id_ruangan = tbl_jadwal.id_ruangan', 'left')
        ->join('tbl_dosen', 'tbl_dosen.id_dosen = tbl_jadwal.id_dosen', 'left')
        ->where('id_mhs', $id_mhs)
        ->where('tbl_krs.id_ta', $id_ta)
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_krs`
LEFT JOIN `tbl_jadwal` ON `tbl_jadwal`.`id_jadwal` = `tbl_krs`.`id_jadwal`
LEFT JOIN `tbl_matkul` ON `tbl_matkul`.`id_matkul` = `tbl_jadwal`.`id_matkul`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_jadwal`.`id_kelas`
LEFT JOIN `tbl_ruangan` ON `tbl_ruangan`.`id_ruangan` = `tbl_jadwal`.`id_ruangan`
LEFT JOIN `tbl_dosen` ON `tbl_dosen`.`id_dosen` = `tbl_jadwal`.`id_dosen`
WHERE `id_mhs` = '3'
AND `tbl_krs`.`id_ta` = '1'

    public function delete_data($data)
    {
        $this->db->table('tbl_krs')
        ->where('id_krs', $data['id_krs'])
        ->delete($data);
---
DELETE FROM `tbl_krs`
WHERE `id_krs` = '2'
AND `id_krs` = '2'