app/Models/modelta.php

SELECT *
FROM `tbl_ta`
WHERE `status` = 1
---
    public function ta_aktif()
    {
       return $this->db->table('tbl_ta')
        ->where('status', 1)
        ->get()
        ->getRowArray();